FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf91_erratas.h
/* ========= Errata 6 ========= */
#if    defined( NRF9160_XXAA ) || defined( DEVELOP_IN_NRF9160 )
    #define NRF91_ERRATA_6_PRESENT    1
#else
    #define NRF91_ERRATA_6_PRESENT    0
#endif

#ifndef NRF91_ERRATA_6_ENABLE_WORKAROUND
    #define NRF91_ERRATA_6_ENABLE_WORKAROUND    NRF91_ERRATA_6_PRESENT
#endif

static bool nrf91_errata_6( void )
{
    #ifndef NRF91_SERIES
        return false;
    #else
        #if defined( NRF9160_XXAA ) || defined( DEVELOP_IN_NRF9160 )
            #if defined( NRF_TRUSTZONE_NONSECURE )
                uint32_t var1 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_NS + 0x00000130ul ) );
                uint32_t var2 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_NS + 0x00000134ul ) );
            #else
                uint32_t var1 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_S + 0x00000130ul ) );
                uint32_t var2 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_S + 0x00000134ul ) );
            #endif
        #endif
        #if defined( NRF9160_XXAA ) || defined( DEVELOP_IN_NRF9160 )
            __DSB();

            if( var1 == 0x09 )
            {
                switch( var2 )
                {
                    case 0x01ul:
                        return true;

                    case 0x02ul:
                        return true;

                    default:
                        return true;
                }
            }
        #endif /* if defined( NRF9160_XXAA ) || defined( DEVELOP_IN_NRF9160 ) */
        return false;
    #endif /* ifndef NRF91_SERIES */
}

/* ========= Errata 7 ========= */
#if    defined( NRF9160_XXAA ) || defined( DEVELOP_IN_NRF9160 )
    #define NRF91_ERRATA_7_PRESENT    1
#else
    #define NRF91_ERRATA_7_PRESENT    0
#endif

#ifndef NRF91_ERRATA_7_ENABLE_WORKAROUND
    #define NRF91_ERRATA_7_ENABLE_WORKAROUND    NRF91_ERRATA_7_PRESENT
#endif

static bool nrf91_errata_7( void )
{
    #ifndef NRF91_SERIES
        return false;
    #else
        #if defined( NRF9160_XXAA ) || defined( DEVELOP_IN_NRF9160 )
            #if defined( NRF_TRUSTZONE_NONSECURE )
                uint32_t var1 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_NS + 0x00000130ul ) );
                uint32_t var2 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_NS + 0x00000134ul ) );
            #else
                uint32_t var1 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_S + 0x00000130ul ) );
                uint32_t var2 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_S + 0x00000134ul ) );
            #endif
        #endif
        #if defined( NRF9160_XXAA ) || defined( DEVELOP_IN_NRF9160 )
            __DSB();

            if( var1 == 0x09 )
            {
                switch( var2 )
                {
                    case 0x01ul:
                        return true;

                    case 0x02ul:
                        return true;

                    default:
                        return true;
                }
            }
        #endif /* if defined( NRF9160_XXAA ) || defined( DEVELOP_IN_NRF9160 ) */
        return false;
    #endif /* ifndef NRF91_SERIES */
}

/* ========= Errata 8 ========= */
#if    defined( NRF9160_XXAA ) || defined( DEVELOP_IN_NRF9160 )
    #define NRF91_ERRATA_8_PRESENT    1
#else
    #define NRF91_ERRATA_8_PRESENT    0
#endif

#ifndef NRF91_ERRATA_8_ENABLE_WORKAROUND
    #define NRF91_ERRATA_8_ENABLE_WORKAROUND    NRF91_ERRATA_8_PRESENT
#endif

static bool nrf91_errata_8( void )
{
    #ifndef NRF91_SERIES
        return false;
    #else
        #if defined( NRF9160_XXAA ) || defined( DEVELOP_IN_NRF9160 )
            #if defined( NRF_TRUSTZONE_NONSECURE )
                uint32_t var1 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_NS + 0x00000130ul ) );
                uint32_t var2 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_NS + 0x00000134ul ) );
            #else
                uint32_t var1 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_S + 0x00000130ul ) );
                uint32_t var2 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_S + 0x00000134ul ) );
            #endif
        #endif
        #if defined( NRF9160_XXAA ) || defined( DEVELOP_IN_NRF9160 )
            __DSB();

            if( var1 == 0x09 )
            {
                switch( var2 )
                {
                    case 0x01ul:
                        return true;

                    case 0x02ul:
                        return false;

                    default:
                        return false;
                }
            }
        #endif /* if defined( NRF9160_XXAA ) || defined( DEVELOP_IN_NRF9160 ) */
        return false;
    #endif /* ifndef NRF91_SERIES */
}

/* ========= Errata 9 ========= */
#if    defined( NRF9160_XXAA ) || defined( DEVELOP_IN_NRF9160 )
    #define NRF91_ERRATA_9_PRESENT    1
#else
    #define NRF91_ERRATA_9_PRESENT    0
#endif

#ifndef NRF91_ERRATA_9_ENABLE_WORKAROUND
    #define NRF91_ERRATA_9_ENABLE_WORKAROUND    NRF91_ERRATA_9_PRESENT
#endif

static bool nrf91_errata_9( void )
{
    #ifndef NRF91_SERIES
        return false;
    #else
        #if defined( NRF9160_XXAA ) || defined( DEVELOP_IN_NRF9160 )
            #if defined( NRF_TRUSTZONE_NONSECURE )
                uint32_t var1 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_NS + 0x00000130ul ) );
                uint32_t var2 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_NS + 0x00000134ul ) );
            #else
                uint32_t var1 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_S + 0x00000130ul ) );
                uint32_t var2 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_S + 0x00000134ul ) );
            #endif
        #endif
        #if defined( NRF9160_XXAA ) || defined( DEVELOP_IN_NRF9160 )
            __DSB();

            if( var1 == 0x09 )
            {
                switch( var2 )
                {
                    case 0x01ul:
                        return false;

                    case 0x02ul:
                        return true;

                    default:
                        return true;
                }
            }
        #endif /* if defined( NRF9160_XXAA ) || defined( DEVELOP_IN_NRF9160 ) */
        return false;
    #endif /* ifndef NRF91_SERIES */
}

/* ========= Errata 10 ========= */
#if    defined( NRF9160_XXAA ) || defined( DEVELOP_IN_NRF9160 )
    #define NRF91_ERRATA_10_PRESENT    1
#else
    #define NRF91_ERRATA_10_PRESENT    0
#endif

#ifndef NRF91_ERRATA_10_ENABLE_WORKAROUND
    #define NRF91_ERRATA_10_ENABLE_WORKAROUND    NRF91_ERRATA_10_PRESENT
#endif

static bool nrf91_errata_10( void )
{
    #ifndef NRF91_SERIES
        return false;
    #else
        #if defined( NRF9160_XXAA ) || defined( DEVELOP_IN_NRF9160 )
            #if defined( NRF_TRUSTZONE_NONSECURE )
                uint32_t var1 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_NS + 0x00000130ul ) );
                uint32_t var2 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_NS + 0x00000134ul ) );
            #else
                uint32_t var1 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_S + 0x00000130ul ) );
                uint32_t var2 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_S + 0x00000134ul ) );
            #endif
        #endif
        #if defined( NRF9160_XXAA ) || defined( DEVELOP_IN_NRF9160 )
            __DSB();

            if( var1 == 0x09 )
            {
                switch( var2 )
                {
                    case 0x01ul:
                        return true;

                    case 0x02ul:
                        return false;

                    default:
                        return false;
                }
            }
        #endif /* if defined( NRF9160_XXAA ) || defined( DEVELOP_IN_NRF9160 ) */
        return false;
    #endif /* ifndef NRF91_SERIES */
}

/* ========= Errata 12 ========= */
#if    defined( NRF9160_XXAA ) || defined( DEVELOP_IN_NRF9160 )
    #define NRF91_ERRATA_12_PRESENT    1
#else
    #define NRF91_ERRATA_12_PRESENT    0
#endif

