FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf91_erratas.h
#ifndef NRF91_ERRATA_12_ENABLE_WORKAROUND
    #define NRF91_ERRATA_12_ENABLE_WORKAROUND    NRF91_ERRATA_12_PRESENT
#endif

static bool nrf91_errata_12( void )
{
    #ifndef NRF91_SERIES
        return false;
    #else
        #if defined( NRF9160_XXAA ) || defined( DEVELOP_IN_NRF9160 )
            #if defined( NRF_TRUSTZONE_NONSECURE )
                uint32_t var1 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_NS + 0x00000130ul ) );
                uint32_t var2 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_NS + 0x00000134ul ) );
            #else
                uint32_t var1 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_S + 0x00000130ul ) );
                uint32_t var2 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_S + 0x00000134ul ) );
            #endif
        #endif
        #if defined( NRF9160_XXAA ) || defined( DEVELOP_IN_NRF9160 )
            __DSB();

            if( var1 == 0x09 )
            {
                switch( var2 )
                {
                    case 0x01ul:
                        return true;

                    case 0x02ul:
                        return false;

                    default:
                        return false;
                }
            }
        #endif /* if defined( NRF9160_XXAA ) || defined( DEVELOP_IN_NRF9160 ) */
        return false;
    #endif /* ifndef NRF91_SERIES */
}

/* ========= Errata 14 ========= */
#if    defined( NRF9160_XXAA ) || defined( DEVELOP_IN_NRF9160 )
    #define NRF91_ERRATA_14_PRESENT    1
#else
    #define NRF91_ERRATA_14_PRESENT    0
#endif

#ifndef NRF91_ERRATA_14_ENABLE_WORKAROUND
    #define NRF91_ERRATA_14_ENABLE_WORKAROUND    NRF91_ERRATA_14_PRESENT
#endif

static bool nrf91_errata_14( void )
{
    #ifndef NRF91_SERIES
        return false;
    #else
        #if defined( NRF9160_XXAA ) || defined( DEVELOP_IN_NRF9160 )
            #if defined( NRF_TRUSTZONE_NONSECURE )
                uint32_t var1 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_NS + 0x00000130ul ) );
                uint32_t var2 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_NS + 0x00000134ul ) );
            #else
                uint32_t var1 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_S + 0x00000130ul ) );
                uint32_t var2 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_S + 0x00000134ul ) );
            #endif
        #endif
        #if defined( NRF9160_XXAA ) || defined( DEVELOP_IN_NRF9160 )
            __DSB();

            if( var1 == 0x09 )
            {
                switch( var2 )
                {
                    case 0x01ul:
                        return true;

                    case 0x02ul:
                        return false;

                    default:
                        return false;
                }
            }
        #endif /* if defined( NRF9160_XXAA ) || defined( DEVELOP_IN_NRF9160 ) */
        return false;
    #endif /* ifndef NRF91_SERIES */
}

/* ========= Errata 15 ========= */
#if    defined( NRF9160_XXAA ) || defined( DEVELOP_IN_NRF9160 )
    #define NRF91_ERRATA_15_PRESENT    1
#else
    #define NRF91_ERRATA_15_PRESENT    0
#endif

#ifndef NRF91_ERRATA_15_ENABLE_WORKAROUND
    #define NRF91_ERRATA_15_ENABLE_WORKAROUND    NRF91_ERRATA_15_PRESENT
#endif

static bool nrf91_errata_15( void )
{
    #ifndef NRF91_SERIES
        return false;
    #else
        #if defined( NRF9160_XXAA ) || defined( DEVELOP_IN_NRF9160 )
            #if defined( NRF_TRUSTZONE_NONSECURE )
                uint32_t var1 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_NS + 0x00000130ul ) );
                uint32_t var2 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_NS + 0x00000134ul ) );
            #else
                uint32_t var1 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_S + 0x00000130ul ) );
                uint32_t var2 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_S + 0x00000134ul ) );
            #endif
        #endif
        #if defined( NRF9160_XXAA ) || defined( DEVELOP_IN_NRF9160 )
            __DSB();

            if( var1 == 0x09 )
            {
                switch( var2 )
                {
                    case 0x01ul:
                        return false;

                    case 0x02ul:
                        return true;

                    default:
                        return true;
                }
            }
        #endif /* if defined( NRF9160_XXAA ) || defined( DEVELOP_IN_NRF9160 ) */
        return false;
    #endif /* ifndef NRF91_SERIES */
}

/* ========= Errata 16 ========= */
#if    defined( NRF9160_XXAA ) || defined( DEVELOP_IN_NRF9160 )
    #define NRF91_ERRATA_16_PRESENT    1
#else
    #define NRF91_ERRATA_16_PRESENT    0
#endif

#ifndef NRF91_ERRATA_16_ENABLE_WORKAROUND
    #define NRF91_ERRATA_16_ENABLE_WORKAROUND    NRF91_ERRATA_16_PRESENT
#endif

static bool nrf91_errata_16( void )
{
    #ifndef NRF91_SERIES
        return false;
    #else
        #if defined( NRF9160_XXAA ) || defined( DEVELOP_IN_NRF9160 )
            #if defined( NRF_TRUSTZONE_NONSECURE )
                uint32_t var1 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_NS + 0x00000130ul ) );
                uint32_t var2 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_NS + 0x00000134ul ) );
            #else
                uint32_t var1 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_S + 0x00000130ul ) );
                uint32_t var2 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_S + 0x00000134ul ) );
            #endif
        #endif
        #if defined( NRF9160_XXAA ) || defined( DEVELOP_IN_NRF9160 )
            __DSB();

            if( var1 == 0x09 )
            {
                switch( var2 )
                {
                    case 0x01ul:
                        return true;

                    case 0x02ul:
                        return false;

                    default:
                        return false;
                }
            }
        #endif /* if defined( NRF9160_XXAA ) || defined( DEVELOP_IN_NRF9160 ) */
        return false;
    #endif /* ifndef NRF91_SERIES */
}

/* ========= Errata 17 ========= */
#if    defined( NRF9160_XXAA ) || defined( DEVELOP_IN_NRF9160 )
    #define NRF91_ERRATA_17_PRESENT    1
#else
    #define NRF91_ERRATA_17_PRESENT    0
#endif

#ifndef NRF91_ERRATA_17_ENABLE_WORKAROUND
    #define NRF91_ERRATA_17_ENABLE_WORKAROUND    NRF91_ERRATA_17_PRESENT
#endif

static bool nrf91_errata_17( void )
{
    #ifndef NRF91_SERIES
        return false;
    #else
        #if defined( NRF9160_XXAA ) || defined( DEVELOP_IN_NRF9160 )
            #if defined( NRF_TRUSTZONE_NONSECURE )
                uint32_t var1 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_NS + 0x00000130ul ) );
                uint32_t var2 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_NS + 0x00000134ul ) );
            #else
                uint32_t var1 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_S + 0x00000130ul ) );
                uint32_t var2 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_S + 0x00000134ul ) );
            #endif
        #endif
        #if defined( NRF9160_XXAA ) || defined( DEVELOP_IN_NRF9160 )
            __DSB();

            if( var1 == 0x09 )
            {
                switch( var2 )
                {
                    case 0x01ul:
                        return true;

                    case 0x02ul:
                        return false;

                    default:
                        return false;
                }
            }
        #endif /* if defined( NRF9160_XXAA ) || defined( DEVELOP_IN_NRF9160 ) */
        return false;
    #endif /* ifndef NRF91_SERIES */
}

/* ========= Errata 20 ========= */
#if    defined( NRF9160_XXAA ) || defined( DEVELOP_IN_NRF9160 )
    #define NRF91_ERRATA_20_PRESENT    1
#else
    #define NRF91_ERRATA_20_PRESENT    0
#endif

#ifndef NRF91_ERRATA_20_ENABLE_WORKAROUND
    #define NRF91_ERRATA_20_ENABLE_WORKAROUND    NRF91_ERRATA_20_PRESENT
#endif

