FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf91_erratas.h
/* ========= Errata 31 ========= */
#if    defined( NRF9160_XXAA ) || defined( DEVELOP_IN_NRF9160 )
    #define NRF91_ERRATA_31_PRESENT    1
#else
    #define NRF91_ERRATA_31_PRESENT    0
#endif

#ifndef NRF91_ERRATA_31_ENABLE_WORKAROUND
    #define NRF91_ERRATA_31_ENABLE_WORKAROUND    NRF91_ERRATA_31_PRESENT
#endif

static bool nrf91_errata_31( void )
{
    #ifndef NRF91_SERIES
        return false;
    #else
        #if defined( NRF9160_XXAA ) || defined( DEVELOP_IN_NRF9160 )
            #if defined( NRF_TRUSTZONE_NONSECURE )
                uint32_t var1 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_NS + 0x00000130ul ) );
                uint32_t var2 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_NS + 0x00000134ul ) );
            #else
                uint32_t var1 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_S + 0x00000130ul ) );
                uint32_t var2 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_S + 0x00000134ul ) );
            #endif
        #endif
        #if defined( NRF9160_XXAA ) || defined( DEVELOP_IN_NRF9160 )
            __DSB();

            if( var1 == 0x09 )
            {
                switch( var2 )
                {
                    case 0x01ul:
                        return true;

                    case 0x02ul:
                        return true;

                    default:
                        return true;
                }
            }
        #endif /* if defined( NRF9160_XXAA ) || defined( DEVELOP_IN_NRF9160 ) */
        return false;
    #endif /* ifndef NRF91_SERIES */
}

/* ========= Errata 32 ========= */
#if    defined( NRF9160_XXAA ) || defined( DEVELOP_IN_NRF9160 )
    #define NRF91_ERRATA_32_PRESENT    1
#else
    #define NRF91_ERRATA_32_PRESENT    0
#endif

#ifndef NRF91_ERRATA_32_ENABLE_WORKAROUND
    #define NRF91_ERRATA_32_ENABLE_WORKAROUND    NRF91_ERRATA_32_PRESENT
#endif

static bool nrf91_errata_32( void )
{
    #ifndef NRF91_SERIES
        return false;
    #else
        #if defined( NRF9160_XXAA ) || defined( DEVELOP_IN_NRF9160 )
            #if defined( NRF_TRUSTZONE_NONSECURE )
                uint32_t var1 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_NS + 0x00000130ul ) );
                uint32_t var2 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_NS + 0x00000134ul ) );
            #else
                uint32_t var1 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_S + 0x00000130ul ) );
                uint32_t var2 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_S + 0x00000134ul ) );
            #endif
        #endif
        #if defined( NRF9160_XXAA ) || defined( DEVELOP_IN_NRF9160 )
            __DSB();

            if( var1 == 0x09 )
            {
                switch( var2 )
                {
                    case 0x01ul:
                        return true;

                    case 0x02ul:
                        return true;

                    default:
                        return true;
                }
            }
        #endif /* if defined( NRF9160_XXAA ) || defined( DEVELOP_IN_NRF9160 ) */
        return false;
    #endif /* ifndef NRF91_SERIES */
}

/* ========= Errata 33 ========= */
#if    defined( NRF9160_XXAA ) || defined( DEVELOP_IN_NRF9160 )
    #define NRF91_ERRATA_33_PRESENT    1
#else
    #define NRF91_ERRATA_33_PRESENT    0
#endif

#ifndef NRF91_ERRATA_33_ENABLE_WORKAROUND
    #define NRF91_ERRATA_33_ENABLE_WORKAROUND    NRF91_ERRATA_33_PRESENT
#endif

static bool nrf91_errata_33( void )
{
    #ifndef NRF91_SERIES
        return false;
    #else
        #if defined( NRF9160_XXAA ) || defined( DEVELOP_IN_NRF9160 )
            #if defined( NRF_TRUSTZONE_NONSECURE )
                uint32_t var1 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_NS + 0x00000130ul ) );
                uint32_t var2 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_NS + 0x00000134ul ) );
            #else
                uint32_t var1 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_S + 0x00000130ul ) );
                uint32_t var2 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_S + 0x00000134ul ) );
            #endif
        #endif
        #if defined( NRF9160_XXAA ) || defined( DEVELOP_IN_NRF9160 )
            __DSB();

            if( var1 == 0x09 )
            {
                switch( var2 )
                {
                    case 0x01ul:
                        return true;

                    case 0x02ul:
                        return true;

                    default:
                        return true;
                }
            }
        #endif /* if defined( NRF9160_XXAA ) || defined( DEVELOP_IN_NRF9160 ) */
        return false;
    #endif /* ifndef NRF91_SERIES */
}

#endif /* NRF91_ERRATAS_H */
